{
  "careers": [
    {
      "id": 1,
      "title": "Senior React Developer",
      "institute": "Fams Technologies",
      "salary": 50000,
      "location": "London, UK",
      "description": {
        "about": "We are an innovative tech company focused on delivering cutting-edge web solutions. We are seeking a highly skilled Senior React Developer to join our dynamic team and play a key role in building world-class applications.",
        "role": {
          "responsibilities": [
            "Design, develop, and maintain high-performance web applications using React.",
            "Collaborate with cross-functional teams to define and deliver robust, scalable solutions.",
            "Optimize applications for maximum speed and scalability.",
            "Mentor and guide junior developers to foster their growth and improve code quality."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "At least 3 years of experience in React development.",
            "Strong proficiency in JavaScript and modern web technologies.",
            "Proven experience in building high-quality, user-friendly web applications.",
            "Excellent problem-solving and communication skills."
          ]
        },
        "compensation": "Competitive salary with performance-based bonuses.",
        "what_on_offer": [
          "A challenging and rewarding work environment.",
          "Opportunity to work with a talented team on innovative projects.",
          "Flexible working options."
        ]
      }
    },
    {
      "id": 2,
      "title": "Plumber",
      "salary": 40000,
      "institute": "Engineer hub",
      "location": "Bowser's Castle",
      "description": {
        "about": "We are a growing company committed to providing top-tier plumbing services. We are looking for a dedicated and experienced Plumber to join our team and help maintain the highest quality standards in our work.",
        "role": {
          "responsibilities": [
            "Install and maintain plumbing systems in residential and commercial settings.",
            "Diagnose plumbing issues and perform necessary repairs.",
            "Ensure all plumbing systems meet safety and quality standards.",
            "Provide customers with expert advice and recommendations."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "Minimum of 2 years of experience as a Plumber.",
            "Strong knowledge of plumbing systems, tools, and techniques.",
            "Excellent problem-solving and diagnostic skills.",
            "Ability to work independently and as part of a team."
          ]
        },
        "compensation": "Competitive salary with performance incentives.",
        "what_on_offer": [
          "Stable career growth and professional development.",
          "Opportunities to work on diverse projects.",
          "Flexible working hours."
        ]
      }
    },
    {
      "id": 3,
      "title": "Gym Leader",
      "salary": 75000,
      "institute": "World ent.",
      "location": "Kanto Region",
      "description": {
        "about": "As a prestigious leader in the world of Pokémon battles, we are looking for an experienced Gym Leader to join our ranks and oversee the challenges within the Kanto Region.",
        "role": {
          "responsibilities": [
            "Organize and oversee gym battles, ensuring fair competition.",
            "Mentor aspiring trainers, providing valuable advice and guidance.",
            "Maintain the gym facilities and ensure they are up to the highest standards.",
            "Promote the spirit of fair play and integrity in Pokémon battles."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "In-depth knowledge of Pokémon battle mechanics and strategies.",
            "Excellent leadership and mentorship abilities.",
            "Ability to manage and motivate a team of trainers.",
            "Strong communication and interpersonal skills."
          ]
        },
        "compensation": "Competitive salary with potential performance bonuses.",
        "what_on_offer": [
          "A unique opportunity to lead in one of the most exciting and dynamic fields.",
          "Access to world-class resources and facilities.",
          "Opportunity to make a significant impact on the next generation of trainers."
        ]
      }
    },
    {
      "id": 4,
      "title": "Vue Developer",
      "salary": 40000,
      "institute": "Ents Technologies",
      "location": "Liverpool, UK",
      "description": {
        "about": "Join our fast-growing tech company as a Vue Developer, where you'll have the opportunity to work on exciting and impactful projects that will shape the future of web development.",
        "role": {
          "responsibilities": [
            "Build and maintain interactive user interfaces using Vue.js.",
            "Work closely with backend developers to ensure seamless integration.",
            "Participate in code reviews to maintain high code quality.",
            "Contribute to architectural decisions and best practices."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "At least 2 years of experience with Vue.js and JavaScript.",
            "Familiarity with front-end build tools and version control systems.",
            "Experience in building scalable, responsive web applications.",
            "Strong communication skills and ability to collaborate effectively in teams."
          ]
        },
        "compensation": "Competitive salary with opportunities for growth.",
        "what_on_offer": [
          "Challenging and innovative projects.",
          "Continuous learning and career development opportunities.",
          "Work-life balance with flexible working options."
        ]
      }
    },
    {
      "id": 5,
      "title": "Tutorial Maker",
      "salary": 35000,
      "institute": "Kemproc",
      "location": "Manchester, UK",
      "description": {
        "about": "We are looking for a creative and passionate Tutorial Maker to join our team. This role will involve developing educational content that helps users master various technical concepts and tools.",
        "role": {
          "responsibilities": [
            "Create engaging and informative tutorials for various topics.",
            "Collaborate with subject matter experts to ensure accuracy.",
            "Develop content across multiple formats, including text, video, and interactive guides.",
            "Maintain and update tutorials to keep them relevant and up to date."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "Experience in content creation, particularly in technical subjects.",
            "Strong written and verbal communication skills.",
            "Creative mindset with a focus on simplifying complex topics.",
            "Familiarity with various content creation tools and platforms."
          ]
        },
        "compensation": "Competitive salary with performance-based incentives.",
        "what_on_offer": [
          "Creative freedom to explore new ideas and formats.",
          "Opportunity to make an impact by educating and empowering others.",
          "Flexible work schedule."
        ]
      }
    },
    {
      "id": 6,
      "title": "Website Manager",
      "salary": 50000,
      "institute": "Fams Technologies",
      "location": "Berlin, Germany",
      "description": {
        "about": "As a Website Manager, you will be responsible for ensuring the smooth operation of our website, optimizing its performance, and improving user engagement.",
        "role": {
          "responsibilities": [
            "Manage the day-to-day operations of the website.",
            "Ensure website functionality, performance, and security are maintained.",
            "Collaborate with design, marketing, and development teams to implement new features.",
            "Monitor analytics and make data-driven decisions to improve user experience."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "At least 2 years of experience in website management or a related field.",
            "Strong knowledge of web technologies and content management systems.",
            "Experience with web analytics tools and performance optimization.",
            "Excellent project management and communication skills."
          ]
        },
        "compensation": "Competitive salary with performance bonuses.",
        "what_on_offer": [
          "Work with an innovative and dynamic team.",
          "Opportunities for personal and professional development.",
          "A supportive and flexible working environment."
        ]
      }
    },
    {
      "id": 7,
      "title": "Food Tester",
      "salary": 30000,
      "institute": "Ketchup Republic",
      "location": "London, UK",
      "description": {
        "about": "We are seeking a detail-oriented and passionate Food Tester to join our team. This role involves evaluating food products to ensure they meet quality standards and customer expectations.",
        "role": {
          "responsibilities": [
            "Conduct sensory evaluations of food products including taste, texture, and smell.",
            "Provide detailed feedback to product development teams.",
            "Ensure food products meet regulatory standards and quality guidelines.",
            "Collaborate with teams to improve product recipes and formulations."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "A refined palate and attention to detail.",
            "Experience in the food industry or sensory analysis is a plus.",
            "Strong communication skills for providing clear feedback.",
            "Ability to work well in a team and collaborate with different departments."
          ]
        },
        "compensation": "Competitive salary with benefits.",
        "what_on_offer": [
          "Exciting opportunities to work with leading food brands.",
          "A chance to contribute to product innovation and improvement.",
          "Flexible working hours."
        ]
      }
    },
    {
      "id": 8,
      "title": "Backend Developer",
      "salary": 55000,
      "institute": "CodeCraft Solutions",
      "location": "Berlin, Germany",
      "description": {
        "about": "We are seeking a talented Backend Developer to join our engineering team. You will be responsible for designing, implementing, and maintaining scalable backend systems that power our applications.",
        "role": {
          "responsibilities": [
            "Develop and maintain server-side logic, ensuring high performance and responsiveness.",
            "Collaborate with frontend developers to integrate user-facing elements.",
            "Optimize database queries and API endpoints for efficiency.",
            "Ensure security best practices are followed across all backend systems."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "At least 3 years of experience in backend development.",
            "Proficiency in Node.js, Python, or Java.",
            "Experience with databases such as PostgreSQL or MongoDB.",
            "Strong problem-solving and debugging skills."
          ]
        },
        "compensation": "Competitive salary with remote work options.",
        "what_on_offer": [
          "Work on cutting-edge technologies.",
          "Flexible working hours and a remote-friendly environment.",
          "Growth opportunities and career advancement."
        ]
      }
    },
    {
      "id": 9,
      "title": "Cybersecurity Analyst",
      "salary": 60000,
      "institute": "SecureTech Global",
      "location": "New York, USA",
      "description": {
        "about": "We are looking for a Cybersecurity Analyst to help safeguard our digital infrastructure from threats. You will play a critical role in identifying, mitigating, and preventing security risks.",
        "role": {
          "responsibilities": [
            "Monitor networks for security breaches and investigate incidents.",
            "Implement security measures to protect sensitive data.",
            "Conduct penetration testing and vulnerability assessments.",
            "Collaborate with IT teams to ensure secure development practices."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "At least 3 years of experience in cybersecurity or IT security.",
            "Familiarity with SIEM tools, firewalls, and intrusion detection systems.",
            "Strong analytical and problem-solving skills.",
            "Cybersecurity certifications such as CEH, CISSP, or CISM are a plus."
          ]
        },
        "compensation": "Attractive salary with security certification sponsorships.",
        "what_on_offer": [
          "Hands-on experience with advanced security tools.",
          "Opportunities for continuous learning and certifications.",
          "Work in a fast-paced, highly innovative environment."
        ]
      }
    },
    {
      "id": 10,
      "title": "AI Researcher",
      "salary": 80000,
      "institute": "NeuralX Labs",
      "location": "San Francisco, USA",
      "description": {
        "about": "We are pushing the boundaries of artificial intelligence and are looking for an AI Researcher to join our team. You will work on groundbreaking projects that redefine machine learning applications.",
        "role": {
          "responsibilities": [
            "Conduct research on deep learning, NLP, and computer vision.",
            "Develop and train machine learning models for real-world applications.",
            "Optimize AI models for efficiency and scalability.",
            "Collaborate with teams to integrate AI solutions into products."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "PhD or Master’s degree in AI, Machine Learning, or related field.",
            "Strong experience with TensorFlow, PyTorch, or Keras.",
            "Proficiency in Python and data science libraries.",
            "Published research in AI conferences is a plus."
          ]
        },
        "compensation": "Competitive salary with research funding opportunities.",
        "what_on_offer": [
          "Access to cutting-edge computing resources.",
          "Collaborate with leading AI researchers.",
          "Opportunities to publish and present research findings."
        ]
      }
    },
    {
      "id": 11,
      "title": "UX/UI Designer",
      "salary": 45000,
      "institute": "CreativePulse Studio",
      "location": "Amsterdam, Netherlands",
      "description": {
        "about": "We are seeking a UX/UI Designer to create stunning and user-friendly digital experiences. You will be responsible for designing intuitive interfaces that enhance user engagement.",
        "role": {
          "responsibilities": [
            "Design wireframes, prototypes, and user flows.",
            "Conduct user research to improve UI/UX strategies.",
            "Collaborate with developers to ensure seamless implementation.",
            "Stay updated with the latest design trends and technologies."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "At least 2 years of experience in UX/UI design.",
            "Proficiency in Figma, Adobe XD, or Sketch.",
            "Strong portfolio showcasing past projects.",
            "Excellent communication and teamwork skills."
          ]
        },
        "compensation": "Competitive salary with creative freedom.",
        "what_on_offer": [
          "Opportunity to work on exciting global projects.",
          "Work in a dynamic, design-driven environment.",
          "Flexible work schedule with remote options."
        ]
      }
    },
    {
      "id": 12,
      "title": "Game Developer",
      "salary": 65000,
      "institute": "PixelForge Studios",
      "location": "Tokyo, Japan",
      "description": {
        "about": "Join our team as a Game Developer and help create immersive gaming experiences. You will work on exciting projects that push the limits of game design and technology.",
        "role": {
          "responsibilities": [
            "Develop and optimize game mechanics using Unity or Unreal Engine.",
            "Collaborate with designers and artists to implement features.",
            "Write clean, maintainable, and efficient code.",
            "Troubleshoot and debug issues to improve game performance."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "Experience in game development using Unity or Unreal Engine.",
            "Proficiency in C# or C++.",
            "Passion for gaming and a deep understanding of game mechanics.",
            "Ability to work in a fast-paced team environment."
          ]
        },
        "compensation": "Competitive salary with game royalties.",
        "what_on_offer": [
          "Opportunity to work on blockbuster game titles.",
          "Access to cutting-edge gaming technologies.",
          "Creative freedom to experiment and innovate."
        ]
      }
    },
    {
      "id": 13,
      "title": "Data Analyst",
      "salary": 55000,
      "institute": "DataSphere Analytics",
      "location": "Toronto, Canada",
      "description": {
        "about": "We are looking for a Data Analyst to turn complex data into actionable insights. You will be responsible for analyzing trends, optimizing strategies, and supporting data-driven decision-making.",
        "role": {
          "responsibilities": [
            "Collect, clean, and analyze large datasets.",
            "Develop reports and dashboards to visualize key insights.",
            "Work closely with teams to optimize business strategies.",
            "Identify trends and make data-backed recommendations."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "Experience with SQL, Python, or R for data analysis.",
            "Proficiency in data visualization tools like Power BI or Tableau.",
            "Strong analytical and problem-solving skills.",
            "Ability to translate data insights into actionable strategies."
          ]
        },
        "compensation": "Competitive salary with data training programs.",
        "what_on_offer": [
          "Work with cutting-edge data analytics tools.",
          "Career growth in a data-driven organization.",
          "Flexible work environment with remote options."
        ]
      }
    },
    {
      "id": 14,
      "title": "Customer Support Specialist",
      "salary": 40000,
      "institute": "HelpDesk Pro",
      "location": "Dublin, Ireland",
      "description": {
        "about": "We are looking for a friendly and empathetic Customer Support Specialist to provide excellent service to our users. You will be the first point of contact for customer inquiries and technical support.",
        "role": {
          "responsibilities": [
            "Respond to customer inquiries via email, chat, and phone.",
            "Troubleshoot technical issues and provide step-by-step assistance.",
            "Maintain accurate records of customer interactions.",
            "Collaborate with teams to improve customer experience."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "Strong communication and problem-solving skills.",
            "Experience in customer support or helpdesk roles.",
            "Ability to handle multiple inquiries efficiently.",
            "Patience and empathy when dealing with customers."
          ]
        },
        "compensation": "Competitive salary with performance bonuses.",
        "what_on_offer": [
          "Supportive and friendly work environment.",
          "Opportunities for professional development.",
          "Flexible working hours and remote options."
        ]
      }
    },
    {
      "id": 15,
      "title": "Digital Marketing Specialist",
      "salary": 45000,
      "institute": "Bright Media",
      "location": "New York, USA",
      "description": {
        "about": "We are looking for a creative and data-driven Digital Marketing Specialist to join our team. This role involves planning and executing marketing campaigns to drive brand awareness and customer engagement.",
        "role": {
          "responsibilities": [
            "Develop and implement digital marketing strategies across various platforms.",
            "Monitor and analyze campaign performance metrics.",
            "Collaborate with content creators to produce engaging marketing materials.",
            "Stay updated on the latest digital marketing trends and tools."
          ]
        },
        "ideal_profile": {
          "requirements": [
            "At least 2 years of experience in digital marketing.",
            "Proficiency in SEO, SEM, and social media marketing.",
            "Strong analytical skills and experience with marketing analytics tools.",
            "Excellent communication and project management skills."
          ]
        },
        "compensation": "Competitive salary with performance-based bonuses.",
        "what_on_offer": [
          "Opportunities for career growth and development.",
          "A dynamic and collaborative work environment.",
          "Flexible working hours and remote work options."
        ]
      }
    }

  ]
}
